---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHandleNameData.SetCustomHandleName(System.String)
source: html/be9c3dcf-0d50-ce98-7dcf-75e9d496ad38.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleNameData.SetCustomHandleName Method

Sets the name of the handle.

## Syntax (C#)
```csharp
public void SetCustomHandleName(
	string customHandleName
)
```

## Parameters
- **customHandleName** (`System.String`) - The name of the handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null